import os
from dotenv import load_dotenv

load_dotenv()

# Читаем настройки TECH-бота
TG_TOKEN = os.getenv("TG_TOKEN_TECH")
TG_CHAT_ID = os.getenv("TG_CHAT_ID_TECH")

CHECK_INTERVAL = 600
MIN_SALARY = 200000 
TARGET_AREAS = ["1", "66"] 
SEARCH_PERIOD = 14 

BLACKLISTED_AREAS = ['40', '160', '159', '97', '48'] 

PROFILES = {
    'Analyst': {
        # Кого ищем
        'keywords': [
            'Business Analyst', 'Бизнес-аналитик',
            'Data Analyst', 'Дата аналитик', 'Аналитик данных',
            'Product Analyst', 'Продуктовый аналитик',
            'BI Analyst', 'BI-аналитик',
            'Руководитель отдела аналитики', 'Lead Analyst',
            'Аналитик процессов'
        ],
        
        # 🔥 ТВОЙ СТЕК
        'target_skills': [
            # Базы и Данные
            'sql', 'mysql', 'postgresql', 'clickhouse', 
            'airflow', 'etl', 'dwh', # Airflow добавил
            
            # Python & Streaming
            'python', 'pandas', 'kafka', 'кафка', 'rabbit',
            
            # BI и Визуализация
            'metabase', 'datalens', 'superset', 
            'finebi', 'fine bi', 'файн биай', # FineBI добавил
            'figma', 'фигма', # Figma добавил
            
            # Управление и Трекеры
            'jira', 'джира', 
            'confluence', 'конфлюенс', 'atlassian',
            'planfix', 'планфикс', # Planfix добавил
            
            # Процессы
            'bpmn', 'управление процессами', 'оптимизация процессов', 'моделирование',
            
            # Интеграции
            'api', 'rest', 'json', 'xml'
        ],

        'stop_words': [
            # 🚫 БАН СИСТЕМНОГО АНАЛИТИКА
            'system analyst', 'системный аналитик', 'системный', 
            
            # Гео (КЗ бан)
            'казахстан', 'kazakhstan', 'алматы', 'астана',
            
            # Мусор
            'junior', 'младший', 'стажер', 'intern', 'assistant', 'ассистент',
            'support', 'поддержка', 'оператор', 'продаж', 'sales', 'call-center',
            'secretary', 'секретарь', 'начальный уровень', 'без опыта',
            '1с', 'консультант', 'методолог', 'sap'
        ]
    }
}