import os
from dotenv import load_dotenv

load_dotenv()

# --- ТОКЕНЫ HR ---
TG_TOKEN = os.getenv("TG_TOKEN_HR")
TG_CHAT_ID = os.getenv("TG_CHAT_ID_HR")

# --- НАСТРОЙКИ ---
USER_AGENT = 'JobSonarBot/6.2 (HR Fix)'
DB_NAME = "jobsonar_hr.db"

CHECK_INTERVAL = 600
MIN_SALARY = 200000 
TARGET_AREAS = ["1", "66"] # Москва, Екб
SEARCH_PERIOD = 14 # Для Whitelist

PROFILES = {
    'HR': {
        'keywords': [
            'HR Director', 'Директор по персоналу', 'HRD', 'Head of HR', 
            'HRBP', 'HR Business Partner', 'People Partner', 
            'Руководитель отдела персонала', 'Начальник управления персоналом',
            'Head of Recruitment', 'Руководитель подбора', 'Head of Talent',
            
            # Роли
            'HR Generalist', 'HRG', 
            'HR Lead', 'Head of C&B', 'Head of T&D',
            
            # Оставляем просто Generalist
            'Generalist' 
        ],
        
        'must_have_hr': [
            'hr', 'персонал', 'кадр', 'люд', 'человеч', 'талант', 'наем', 'найм', 
            'подбор', 'рекрут', 'обучен', 'развити', 'компенсац', 'льгот', 
            'оплат', 'труд', 'бренд', 'культур', 'социальн',
            'people', 'talent', 'human', 'recruit', 'learning', 'c&b', 'rewards',
            'generalist'
        ],

        'must_have_role': [
            'hrd', 'hrbp', 'директор', 'director', 'head', 'lead', 'partner', 'партнер', 
            'руководител', 'начальник', 'заместител', 'глава', 'лидер', 'chief',
            'generalist', 'hrg', 'ведущий', 'senior'
        ],

        'stop_words': [
            # 🚫 НОВЫЕ ФИЛЬТРЫ (Мусор из логов)
            'machine learning', 'машинн', 'learning', 'deep learning', # Чтобы не лезли ML эксперты
            'personal manager', 'персональный', 'vip-менеджер', # Это продажи в банках
            'клиентский', 'client', 'account', # Sales
            
            # ГЕО
            'казахстан', 'kazakhstan', 'алматы', 'астана', 'ташкент', 'минск',
            
            # IT & TECH
            'инженер', 'разработчик', 'developer', 'аналитик', 'it-проект', 
            'безопасн', 'hardware', 'embedded', 'телефония', 'вкс', 'тестиров',
            'системный', 'администратор', 'программист', 'product', 'project',
            
            # GAMEDEV, DESIGN, ART
            '3d', '2d', 'artist', 'артист', 'художник', 'art', 'арт',
            'game', 'gamedev', 'гейм', 'игр', 'level', 'environment',
            'unreal', 'unity', 'engine', 'движок', 'render', 'рендер',
            'motion', 'моушн', 'video', 'видео', 'montage', 'монтаж',
            'designer', 'дизайнер', 'ux', 'ui', 'creative', 'креатив',
            'ai', 'artificial', 'intelligence', 'нейро', 'neural',
            'vfx', 'visual', 'animator', 'аниматор', 'modeler', 'моделлер',
            'texture', 'текстур', 'light', 'свет', 'sound', 'звук',
            
            # БУХГАЛТЕРИЯ И ФИНАНСЫ
            'бухгалтер', 'счетов', 'расчет', 'казначей', 'экономист', 'финанс',
            'аудит', 'налог', 'отчетность', 'смет', 'бюджет', 'актуарий',
            'эмисси', 'карт', 'bank', 'banking', 'инвестиц', 'актив',
            
            # ПРОДАЖИ
            'продаж', 'sales', 'сбыт', 'закуп', 'тендер',
            'kam', 'b2b', 'b2c', 'магазин', 'торгов',
            'бизнес', 'business development', 'bizdev', 'коммерч',
            
            # МАРКЕТИНГ
            'маркетинг', 'marketing', 'pr', 'пиар', 'реклам', 'smm', 'content',
            'контент', 'media', 'медиа', 'event', 'ивент', 'продукт',
            'brand manager', 'бренд-менеджер', 'бренд менеджер',
            
            # АДМИН И ПРОЧЕЕ
            'assistant', 'ассистент', 'стажер', 'intern', 'junior', 'джуниор', 
            'секретарь', 'делопроизвод', 'курьер', 'водитель', 'уборщ', 
            'офис-менеджер', 'администратор', 'хозяйств', 'ахо'
        ]
    }
}